<?php
// Уважно передивитись, як саме підключаємо файли
// Запустити та налаштувати nginx + php (вказати шлях до проєкту в конфігурації nginx)
// Відкрити в браузері сторінку http://localhost або http://127.0.0.1
// Подивитись як все виглядає та повернутись сюди.

// Створимо змінну, що буде зберігати адресу,
// введену користувачем в адресну стрічку браузера
// Якщо вона не вказана, то буде використана адреса головної сторінки


    $uri = $_SERVER['REQUEST_URI'] ?? '../pages/main';

// за допомогою логічного виразу визначимо,
// яку сторінку потрібно показати користувачу

    switch ($uri) {
        case '../pages/main':case '/': // Тут ми вказали два варіанти адреси головної сторінки
            include_once 'pages/main.php';
            break;
        case '/page1': // Тут ми вказали адресу сторінки 1
            include_once 'pages/hometasks/1/index.php';
            break;
        case '/page2': // Тут ми вказали адресу сторінки 2
            include_once 'pages/hometasks/2/index.php';
            break;
        case '/page3': // Тут ми вказали адресу сторінки 3
            include_once 'pages/hometasks/3/index.php';
            break;
        default: // Якщо адреса не відповідає жодному з варіантів,
            // то виведемо сторінку 404
            include_once 'pages/404.php';
            break;
    }
?>